[
  {
    "author": "Robert J. Sawyer",
    "id": 125,
    "quote": "Whether it's created in a lab, written by a programmer, or lands on the White House lawn as a visitor from the stars, if it acts like a human being, it is a human being."
  },
  {
    "author": "Larry Wilmore",
    "id": 124,
    "quote": "The last thing I would ever do is try to become a network programmer."
  },
  {
    "author": "Sunil Nagaraj",
    "id": 123,
    "quote": "My background is as a computer scientist and programmer."
  },
  {
    "author": "Tyler Winklevoss",
    "id": 122,
    "quote": "We didn't grow up in a jock household. In fact, my dad is an entrepreneur. He was a computer programmer; he was a professor of actuarial science at Wharton for 13 years, then started his own company that was software-based."
  },
  {
    "author": "Chelsea Manning",
    "id": 121,
    "quote": "In the years preceding my imprisonment, I worked as a software programmer, designing and developing web interfaces, secure databases, and communication software; later, I was employed as an intelligence analyst for the U.S. Army. Throughout each of these jobs, we used different kinds of encryption to keep prying eyes out of information we handled."
  },
  {
    "author": "Ellen Ullman",
    "id": 120,
    "quote": "Evolution, dismissed as a sloppy programmer, has seen fit to create us as a wild amalgam of everything that came before us: except for the realm of insects, the whole history of life on earth is inscribed within our bodies."
  },
  {
    "author": "Ellen Ullman",
    "id": 119,
    "quote": "Writing was a way to get away from my life as a programmer, so I wanted to write about other things, but of course nobody wanted to publish another story about a family, unless it was extraordinary. When I began writing about my life as a programmer, however, people were interested."
  },
  {
    "author": "Ellen Ullman",
    "id": 118,
    "quote": "I don't like the idea that Facebook controls how people express themselves and changes it periodically according to whatever algorithms they use to figure out what they should do or the whim of some programmer or some CEO. That bothers me a great deal."
  },
  {
    "author": "Ellen Ullman",
    "id": 117,
    "quote": "My approach to being a self-taught programmer was to find out who was smart and who would be helpful, and these were - these are both men and women. And without learning from my co-workers, I never could've gone on in the profession as long as I did."
  },
  {
    "author": "Bobby Kotick",
    "id": 116,
    "quote": "I think that's the responsibility of the CEO and the CEOs below me: to make sure that we're constantly putting people in places where they have the opportunity to develop into those careers but also having a rewards and recognition system that allows a great programmer to stay as a great programmer."
  },
  {
    "author": "Caterina Fake",
    "id": 115,
    "quote": "When I was a kid, I really wanted to be a writer and an artist when I grew up. So in college, I was an English major, and then I became a fine artist. But when I arrived in San Francisco in 1995, I figured I could leverage my artistic skills by becoming a Web designer and programmer."
  },
  {
    "author": "Eva Gutowski",
    "id": 114,
    "quote": "My dad grew up as a computer programmer, so he always had random computer software, and I started opening up editing software at age 12 and figuring out how to build websites."
  },
  { "author": "Paul Allen", "id": 113, "quote": "I was a programmer." },
  {
    "author": "Paul Allen",
    "id": 112,
    "quote": "As a programmer, you're working with very simple structures compared to the brain. So I was always fascinated by how the brain works."
  },
  {
    "author": "Satoru Iwata",
    "id": 111,
    "quote": "People sometimes ask me what I did when I was hired at HAL. The answer is that I was a programmer. And an engineer. And a designer. And I marketed our games. I also ordered food. And I helped clean up. And, it was all great fun."
  },
  {
    "author": "Sheamus",
    "id": 110,
    "quote": "The funny thing was, with IT, I was never really a tech type of person: I was better with people, good at dealing with people. I had technical experience; I knew the nitty gritty. I could never be a programmer or anything, but I knew my way around."
  },
  {
    "author": "Gopi Sundar",
    "id": 109,
    "quote": "I worked as a programmer for 16 years."
  },
  {
    "author": "Hannah Fry",
    "id": 108,
    "quote": "And anytime a programmer makes a decision about how to deal with data, how to average it or clean it, you're imparting more of your own bias on it."
  },
  {
    "author": "Alexandra Elbakyan",
    "id": 107,
    "quote": "I am a freelance programmer so I am flexible about my working hours and have quite a lot of free time."
  },
  {
    "author": "Jacky Rosen",
    "id": 106,
    "quote": "Before coming to Congress, I worked as a computer programmer and a systems analyst."
  },
  {
    "author": "Jacky Rosen",
    "id": 105,
    "quote": "I am a granddaughter of immigrants, put myself through college as a waitress, and I started my career as a computer programmer."
  },
  {
    "author": "Larry Wall",
    "id": 104,
    "quote": "The three chief virtues of a programmer are: Laziness, Impatience and Hubris."
  },
  {
    "author": "Satoru Iwata",
    "id": 103,
    "quote": "On my business card, I am a corporate president. In my mind, I am a computer programmer. But in my heart, I am a gamer."
  },
  {
    "author": "J. Cole",
    "id": 102,
    "quote": "I actually started off majoring in computer science, but I knew right away I wasn't going to stay with it. It was because I had this one professor who was the loneliest, saddest man I've ever known. He was a programmer, and I knew that I didn't want to do whatever he did. So after that, I switched to Communications."
  },
  {
    "author": "Hannah Simone",
    "id": 101,
    "quote": "When I lived in London, I worked at the U.N. for a while as its human rights and refugees officer. I have two degrees, and my second was in radio. I was a programmer and news reporter in Canada. My CV looks bananas."
  },
  {
    "author": "John Carmack",
    "id": 100,
    "quote": "Low-level programming is good for the programmer's soul."
  },
  {
    "author": "Seymour Cray",
    "id": 99,
    "quote": "The trouble with programmers is that you can never tell what a programmer is doing until it's too late."
  },
  {
    "author": "John Carmack",
    "id": 98,
    "quote": "Because of the nature of Moore's law, anything that an extremely clever graphics programmer can do at one point can be replicated by a merely competent programmer some number of years later."
  },
  {
    "author": "Markus Persson",
    "id": 97,
    "quote": "I'm not an entrepreneur. I'm not a CEO. I'm a nerdy computer programmer who likes to have opinions on Twitter."
  },
  {
    "author": "Edsger Dijkstra",
    "id": 96,
    "quote": "The competent programmer is fully aware of the limited size of his own skull. He therefore approaches his task with full humility, and avoids clever tricks like the plague."
  },
  {
    "author": "Eric Allman",
    "id": 95,
    "quote": "The intellectual property situation is bad and getting worse. To be a programmer, it requires that you understand as much law as you do technology."
  },
  {
    "author": "John Carmack",
    "id": 94,
    "quote": "Programming is not a zero-sum game. Teaching something to a fellow programmer doesn't take it away from you. I'm happy to share what I can, because I'm in it for the love of programming."
  },
  {
    "author": "Kent Beck",
    "id": 93,
    "quote": "The world is changing, and I believe that, if I want to stay employed as a programmer, I'm going to have to change with it."
  },
  {
    "author": "John Gruber",
    "id": 92,
    "quote": "I went to Drexel University, majored in computer science. Drexel has a great program - they call it co-op - but its, like, mandatory to graduate to do internships. I loved it because it helped me figure out very quickly that I didn't really want to be a programmer."
  },
  {
    "author": "Brianna Wu",
    "id": 91,
    "quote": "I am a programmer. If I write code, I don't evaluate the results by what I hope the code will be. I evaluate it by what happens when I compile it. I evaluate it by results."
  },
  {
    "author": "Andy Weir",
    "id": 90,
    "quote": "I was hired as a computer programmer for a national laboratory at age 15."
  },
  {
    "author": "Rick Smolan",
    "id": 89,
    "quote": "I'm not a computer person at all. I only know how to turn them on. I'm not a programmer. I couldn't program my way out of a paper bag."
  },
  {
    "author": "Naval Ravikant",
    "id": 88,
    "quote": "Any competent programmer has an API to cash, payments, escrow, wills, notaries, lotteries, dividends, micropayments, subscriptions, crowdfunding, and more."
  },
  {
    "author": "Alan Perlis",
    "id": 87,
    "quote": "You can measure a programmer's perspective by noting his attitude on the continuing vitality of FORTRAN."
  },
  {
    "author": "Charles Best",
    "id": 86,
    "quote": "I created DonorsChoose by putting pencil to paper - literally - and sketching out each screen of the web site and how it would work. Then I paid a programmer from Poland $1,500 to turn my sketches and common-sense rules into a functioning website."
  },
  {
    "author": "Markus Persson",
    "id": 85,
    "quote": "I have the ability to get code done, but I'm impatient, and it's scrappy as a result. Maybe that helped me with 'Minecraft,' as it came quickly. But, well, at some point, I'd like to actually become a good programmer."
  },
  {
    "author": "Reshma Saujani",
    "id": 84,
    "quote": "In the '80s, society created a caricature of what a hacker or a programmer looked like: a guy wearing a hoodie, drinking energy drinks, sitting in a basement somewhere coding. Today, programmers look like the men we see in the show 'Silicon Valley' on HBO. If you look at the message girls are getting, it's saying, 'This is not for you.'"
  },
  {
    "author": "John Morrison",
    "id": 83,
    "quote": "Everyone needs to move - if you're a pro athlete, a contortionist, a computer programmer, or just somebody who wants to play with their kids."
  },
  {
    "author": "Martha Stewart",
    "id": 82,
    "quote": "Whether you're a programmer or a seamstress, it's all about new techniques, simplifying old techniques, and consolidating steps. Making things go faster - but not worse."
  },
  {
    "author": "Jacky Rosen",
    "id": 81,
    "quote": "Before representing Nevada in Congress, I worked in Las Vegas as a computer programmer and systems analyst in what's been long considered a male-dominated industry. It wasn't easy."
  },
  {
    "author": "Robert Patterson",
    "id": 80,
    "quote": "I am a composer, horn player, and computer programmer."
  },
  {
    "author": "Paul Allen",
    "id": 79,
    "quote": "If you have an analytical bent like I do, going back to my days as a programmer, you like to ask questions."
  },
  { "author": "Ken Thompson", "id": 78, "quote": "I am a programmer." },
  {
    "author": "Clara Shih",
    "id": 77,
    "quote": "My high school, the Illinois Mathematics and Science Academy, showed me that anything is possible and that you're never too young to think big. At 15, I worked as a computer programmer at the Fermi National Accelerator Laboratory, or Fermilab. After graduating, I attended Stanford for a degree in economics and computer science."
  },
  {
    "author": "Brenda Laurel",
    "id": 76,
    "quote": "When I got started, I was a sideshow. At my first Consumer Electronics Show, in 1977 in Chicago, people came from all over the floor to see the 'lady programmer.' They had me dressed in a turquoise lab coat with my name embroidered on the pocket."
  },
  {
    "author": "Orson Scott Card",
    "id": 75,
    "quote": "God, our genes, our environment, or some stupid programmer keying in code at an ancient terminal - there's no way free will can ever exist if we as individuals are the result of some external cause."
  },
  {
    "author": "Ellen Ullman",
    "id": 74,
    "quote": "To be a programmer is to develop a carefully managed relationship with error. There's no getting around it. You either make your accommodations with failure, or the work will become intolerable."
  },
  {
    "author": "Bram Cohen",
    "id": 73,
    "quote": "The mark of a mature programmer is willingness to throw out code you spent time on when you realize it's pointless."
  },
  {
    "author": "Scott Adams",
    "id": 72,
    "quote": "Before 'Dilbert,' I tried to become a computer programmer. In the early days of computing, I bought this big, heavy, portable computer for my house. I spent two years nights and weekends trying to write games that I thought I would sell. Turns out I'm not that good a programmer, so that was two years that didn't work out."
  },
  {
    "author": "Alan Perlis",
    "id": 71,
    "quote": "We toast the Lisp programmer who pens his thoughts within nests of parentheses."
  },
  {
    "author": "Tim Sweeney",
    "id": 70,
    "quote": "Some folks actually talk a whole lot more than me, so I'm grateful for the people like Cliff Bleszinski. He talks about our games, and Mark Rein talks about our business strategy. I'm the shy programmer myself."
  },
  {
    "author": "Aaron Koblin",
    "id": 69,
    "quote": "The truth is I'm not actually an expert programmer! I really don't consider myself to be an expert at anything. For me, it's more about having a well-rounded and broad horizon. I think that's where a lot of the more interesting things come from - mashing up completely disparate aspects of life to create something new and original."
  },
  {
    "author": "J. Cole",
    "id": 68,
    "quote": "I actually started off majoring in computer science, but I knew right away I wasn't going to stay with it. It was because I had this one professor who was the loneliest, saddest man I've ever known. He was a programmer, and I knew that I didn't want to do whatever he did."
  },
  {
    "author": "Masi Oka",
    "id": 67,
    "quote": "I wasn't the best UI programmer, but I know to use the interface and that stuff. It's definitely given me a leg up in terms of being able to talk to the people in the games industry."
  },
  {
    "author": "Du Yun",
    "id": 66,
    "quote": "I'm not a programmer; I'm more of a performer. I'm really bad at math."
  },
  {
    "author": "Sherrilyn Kenyon",
    "id": 65,
    "quote": "I've been a DJ, janitor, ditch digger, waitress, computer instructor, programmer, mechanic, web developer, clerk, manager, marketing director, tour guide and dorm manager, among other things."
  },
  {
    "author": "Brian Behlendorf",
    "id": 64,
    "quote": "And, I think that is actually appropriate because I'm really not the world's best programmer, I think it's a good thing that I'm not touching the code."
  },
  {
    "author": "iJustine",
    "id": 63,
    "quote": "I originally studied graphic design and video production. I had wanted to be a programmer - I loved development and coding - but it turned out that I really enjoyed doing the frontend more than backend development."
  },
  {
    "author": "Yukihiro Matsumoto",
    "id": 62,
    "quote": "From the viewpoint of what you can do, therefore, languages do differ - but the differences are limited. For example, Python and Ruby provide almost the same power to the programmer."
  },
  {
    "author": "Bill Budge",
    "id": 61,
    "quote": "It always helps to be a good programmer. It is important to like computers and to be able to think of things people would want to do with their computers."
  },
  {
    "author": "Jon Postel",
    "id": 60,
    "quote": "Then I started graduate school at UCLA. I got a part time research assistant job as a programmer on a project involving the use of one computer to measure the performance of another computer."
  },
  {
    "author": "Shawn Fanning",
    "id": 59,
    "quote": "If you're a musician or actor, you know that if you're successful, some level of fame goes along with that. You're prepared. But how often does that happen to a programmer?"
  },
  {
    "author": "Oren Peli",
    "id": 58,
    "quote": "By trade, I am a software programmer, so I never really had any experience with movies before. I started out with 'Paranormal Activity.'"
  },
  {
    "author": "Jessica Livingston",
    "id": 57,
    "quote": "Finding a programmer to work with if you don't already know one will be a challenge. Merely judging if a programmer is exceptional vs. competent will be very hard if you are not one yourself. When you do find someone, work together informally for a while to test your compatibility."
  },
  {
    "author": "Kevin Mitnick",
    "id": 56,
    "quote": "The government does things like insisting that all encryption programs should have a back door. But surely no one is stupid enough to think the terrorists are going to use encryption systems with a back door. The terrorists will simply hire a programmer to come up with a secure encryption scheme."
  },
  {
    "author": "Clive Thompson",
    "id": 55,
    "quote": "If you, or any public-spirited programmer, wanted to figure out what the software on your machine is really doing, tough luck. It's illegal to reverse engineer the source code of commercial software to find out how it works."
  },
  {
    "author": "Rebecca MacKinnon",
    "id": 54,
    "quote": "You don't have to be a nerd or a programmer or a network engineer to make a difference."
  },
  {
    "author": "Warren Spector",
    "id": 53,
    "quote": "I remember on Deus Ex there was one programmer - Alex Durand, a guy who still works for us - he decided he was going to get through the game without ever using a weapon. I would never think to do that. And that's fine."
  },
  {
    "author": "John Gurdon",
    "id": 52,
    "quote": "It's a very complex network of genes making products which go into the nucleus and turn on other genes. And, in fact, you find a continuing network of processes going on in a very complex way by which genes are subject to these continual adjustments, as you might say - the computer programmer deciding which genes ultimately will work."
  },
  {
    "author": "Kent Beck",
    "id": 51,
    "quote": "We could talk, act, and dress funny. We were excused for socially inappropriate behavior: 'Oh, he's a programmer'. It was all because we knew this technology stuff that other people found completely mystifying."
  },
  {
    "author": "Graham Moore",
    "id": 50,
    "quote": "Space camp was actually, like, the best summer of my life. It was amazing. But I thought I wanted to be a computer programmer, and among computer science folks, Turing is this object of cult-like fascination."
  },
  {
    "author": "Gene Luen Yang",
    "id": 49,
    "quote": "My first job was as a programmer. So I feel like I'm familiar with the information technology sector and the information technology culture."
  },
  {
    "author": "G. Willow Wilson",
    "id": 48,
    "quote": "I'm not a programmer myself, but I am a very, very picky end user of technology. I like my machines to work they way they're supposed to, all the time."
  },
  {
    "author": "G. Willow Wilson",
    "id": 47,
    "quote": "In all likelihood, you've been treated by a Muslim doctor or served by a Muslim waiter or worked beside a Muslim computer programmer. Even if you think, 'I don't know any Muslims,' it's probably not true."
  },
  {
    "author": "Kevin Systrom",
    "id": 46,
    "quote": "It's funny: I was a photographer before I was a programmer."
  },
  {
    "author": "Jason Fried",
    "id": 45,
    "quote": "I'm a designer, but I rely on programmers to bring my ideas to life. By learning to code myself, I think I can make things easier for all of us. Similarly, I want to be able to build things on my own without having to bother a programmer."
  },
  {
    "author": "Bill Sempf",
    "id": 44,
    "quote": "QA Engineer walks into a bar. Orders a beer. Orders 0 beers. Orders 999999999 beers. Orders a lizard. Orders -1 beers. Orders a sfdeljknesv."
  },
  {
    "author": "Phil Karlton",
    "id": 43,
    "quote": "There are only two hard things in Computer Science: cache invalidation, naming things and off-by-one errors."
  },
  {
    "author": "Jeff Atwood",
    "id": 42,
    "quote": "In software, we rarely have meaningful requirements. Even if we do, the only measure of success that matters is whether our solution solves the customer’s shifting idea of what their problem is."
  },
  {
    "author": "Robert Sewell",
    "id": 41,
    "quote": "If Java had true garbage collection, most programs would delete themselves upon execution."
  },
  {
    "author": "Gavin Russell Baker",
    "id": 40,
    "quote": "C++ : Where friends have access to your private members."
  },
  {
    "author": "Bjarne Stroustrup",
    "id": 39,
    "quote": "In C++ it’s harder to shoot yourself in the foot, but when you do, you blow off your whole leg."
  },
  {
    "author": "Alan Kay",
    "id": 38,
    "quote": "Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves."
  },
  {
    "author": "Larry DeLuca",
    "id": 37,
    "quote": "I’ve noticed lately that the paranoid fear of computers becoming intelligent and taking over the world has almost entirely disappeared from the common culture.  Near as I can tell, this coincides with the release of MS-DOS."
  },
  {
    "author": "Mark Gibbs",
    "id": 36,
    "quote": "No matter how slick the demo is in rehearsal, when you do it in front of a live audience, the probability of a flawless presentation is inversely proportional to the number of people watching, raised to the power of the amount of money involved."
  },
  {
    "author": "Henry Petroski",
    "id": 35,
    "quote": "The most amazing achievement of the computer software industry is its continuing cancellation of the steady and staggering gains made by the computer hardware industry."
  },
  {
    "author": "Jeremy S. Anderson",
    "id": 34,
    "quote": "There are two major products that come out of Berkeley: LSD and UNIX.  We don’t believe this to be a coincidence."
  },
  {
    "author": "Sam Ewing",
    "id": 33,
    "quote": "Computers are like bikinis. They save people a lot of guesswork."
  },
  {
    "author": "Jamie Zawinski",
    "id": 32,
    "quote": "Linux is only free if your time has no value."
  },
  {
    "author": "Dick Brandon",
    "id": 31,
    "quote": "Documentation is like sex; when it's good, it's very, very good, and when it's bad, it's better than nothing."
  },
  {
    "author": "Richard Moore",
    "id": 30,
    "quote": "The difference between theory and practice is that in theory, there is no difference between theory and practice."
  },
  {
    "author": "Michael Sinz",
    "id": 29,
    "quote": "Programming is like sex: one mistake and you’re providing support for a lifetime."
  },
  {
    "author": "Bjarne Stroustrup",
    "id": 28,
    "quote": "There are only two kinds of programming languages: those people always bitch about and those nobody uses."
  },
  {
    "author": "Donald Knuth",
    "id": 27,
    "quote": "Beware of bugs in the above code; I have only proved it correct, not tried it. "
  },
  {
    "author": "Tom Van Vleck",
    "id": 26,
    "quote": "We know about as much about software quality problems as they knew about the Black Plague in the 1600s. We’ve seen the victims’ agonies and helped burn the corpses. We don’t know what causes it; we don’t really know if there is only one disease. We just suffer — and keep pouring our sewage into our water supply."
  },
  {
    "author": "N.J. Rubenking",
    "id": 25,
    "quote": "Writing the first 90 percent of a computer program takes 90 percent of the time. The remaining ten percent also takes 90 percent of the time and the final touches also take 90 percent of the time."
  },
  {
    "author": "C. A. R. Hoare",
    "id": 24,
    "quote": "There are two ways of constructing a software design; one way is to make it so simple that there are obviously no deficiencies, and the other way is to make it so complicated that there are no obvious deficiencies. The first method is far more difficult."
  },
  {
    "author": "James O. Coplien",
    "id": 23,
    "quote": "You should name a variable using the same care with which you name a first-born child."
  },
  {
    "author": "Fred Brooks",
    "id": 22,
    "quote": "Einstein argued that there must be simplified explanations of nature, because God is not capricious or arbitrary. No such faith comforts the software engineer."
  },
  {
    "author": "Unknown",
    "id": 21,
    "quote": "XML is like violence – if it doesn’t solve your problems, you are not using enough of it."
  },
  {
    "author": "Unknown",
    "id": 20,
    "quote": "Saying that Java is good because it works on all platforms is like saying anal sex is good because it works on all genders."
  },
  {
    "author": "Douglas Adams",
    "id": 19,
    "quote": "I love deadlines. I like the whooshing sound they make as they fly by."
  },
  {
    "author": "Keith Bostic",
    "id": 18,
    "quote": "Perl – The only language that looks the same before and after RSA encryption."
  },
  {
    "author": "Albert Einstein",
    "id": 17,
    "quote": "Two things are infinite: the universe and human stupidity; and I’m not sure about the universe."
  },
  {
    "author": "Yogi Berra",
    "id": 16,
    "quote": "In theory, theory and practice are the same. In practice, they’re not."
  },
  {
    "author": "E. W. Dijkstra",
    "id": 15,
    "quote": "It is practically impossible to teach good programming style to students that have had prior exposure to BASIC. As potential programmers, they are mentally mutilated beyond hope of regeneration."
  },
  {
    "author": "E. W. Dijkstra",
    "id": 14,
    "quote": "If debugging is the process of removing software bugs, then programming must be the process of putting them in."
  },
  {
    "author": "Mitch Ratcliffe",
    "id": 13,
    "quote": "A computer lets you make more mistakes faster than any other invention in human history, with the possible exceptions of handguns and tequila."
  },
  {
    "author": "Bjarne Stroustrup",
    "id": 12,
    "quote": "I have always wished for my computer to be as easy to use as my telephone; my wish has come true because I can no longer figure out how to use my telephone."
  },
  {
    "author": "Ovidiu Platon",
    "id": 11,
    "quote": "I don’t care if it works on your machine! We are not shipping your machine!"
  },
  {
    "author": "Rich Cook",
    "id": 10,
    "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning."
  },
  {
    "author": "Rick Osborne",
    "id": 9,
    "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live."
  },
  {
    "author": "Charles Babbage",
    "id": 8,
    "quote": "On two occasions I have been asked, ‘Pray, Mr. Babbage, if you put into the machine wrong figures, will the right answers come out?’ I am not able rightly to apprehend the kind of confusion of ideas that could provoke such a question.”"
  },
  {
    "author": "Jon Ribbens",
    "id": 7,
    "quote": "PHP is a minor evil perpetrated and created by incompetent amateurs, whereas Perl is a great and insidious evil, perpetrated by skilled but perverted professionals."
  },
  {
    "author": "Bill Gates",
    "id": 6,
    "quote": "Measuring programming progress by lines of code is like measuring aircraft building progress by weight."
  },
  {
    "author": "Brian Kernighan",
    "id": 5,
    "quote": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it."
  },
  {
    "author": "Jamie Zawinski",
    "id": 4,
    "quote": "Some people, when confronted with a problem, think “I know, I’ll use regular expressions.” Now they have two problems."
  },
  {
    "author": "Hofstadter’s Law",
    "id": 3,
    "quote": "It always takes longer than you expect, even when you take into account Hofstadter’s Law."
  },
  {
    "author": "Edward V Berard",
    "id": 2,
    "quote": "Walking on water and developing software from a specification are easy if both are frozen."
  },
  {
    "author": "C. A. R. Hoare",
    "id": 1,
    "quote": "We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil."
  }
]
